---
kind: method
id: M:Autodesk.Revit.DB.CurveArray.Insert(Autodesk.Revit.DB.Curve,System.Int32)
source: html/2e0e43f1-b22f-8338-e965-adc8a2d5d55d.htm
---
# Autodesk.Revit.DB.CurveArray.Insert Method

Insert the specified curve into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	Curve item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Curve`) - The curve to be inserted into the array.
- **index** (`System.Int32`) - The curve will be inserted before this index.

## Returns
Returns whether the curve was inserted into the array.